02-Res-Latency-Social1-Swarm/social1-machine1/Res-firecracker-random-Swarm-v1-machine1/firecracker_t_10_c_30_composePosts_composeVcpu_4_wrkVcpu_1_R_1500/wrk.txt
Running 1m test @ http://nginx-thrift:8080/wrk2-api/post/compose
  10 threads and 30 connections
  Thread calibration: mean lat.: 25.664ms, rate sampling interval: 192ms
  Thread calibration: mean lat.: 32.225ms, rate sampling interval: 250ms
  Thread calibration: mean lat.: 24.730ms, rate sampling interval: 166ms
  Thread calibration: mean lat.: 29.673ms, rate sampling interval: 211ms
  Thread calibration: mean lat.: 29.760ms, rate sampling interval: 167ms
  Thread calibration: mean lat.: 28.486ms, rate sampling interval: 165ms
  Thread calibration: mean lat.: 26.673ms, rate sampling interval: 170ms
  Thread calibration: mean lat.: 29.153ms, rate sampling interval: 169ms
  Thread calibration: mean lat.: 27.773ms, rate sampling interval: 192ms
  Thread calibration: mean lat.: 34.369ms, rate sampling interval: 237ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    20.68ms   42.64ms 212.22ms   89.96%
    Req/Sec   150.15     45.08   295.00     76.61%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.87ms
 75.000%    9.62ms
 90.000%   63.71ms
 99.000%  212.22ms
 99.900%  329.21ms
 99.990%  389.89ms
 99.999%  404.48ms
100.000%  410.62ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.577     0.000000            1         1.00
       3.937     0.100000         7538         1.11
       4.363     0.200000        15068         1.25
       4.771     0.300000        22514         1.43
       5.255     0.400000        30068         1.67
       5.871     0.500000        37528         2.00
       6.283     0.550000        41300         2.22
       6.791     0.600000        45048         2.50
       7.459     0.650000        48789         2.86
       8.367     0.700000        52558         3.33
       9.623     0.750000        56286         4.00
      10.543     0.775000        58160         4.44
      11.823     0.800000        60037         5.00
      13.951     0.825000        61919         5.71
      19.135     0.850000        63790         6.67
      36.383     0.875000        65665         8.00
      49.823     0.887500        66605         8.89
      63.711     0.900000        67539        10.00
      78.079     0.912500        68478        11.43
      92.031     0.925000        69417        13.33
     106.303     0.937500        70354        16.00
     113.727     0.943750        70822        17.78
     121.535     0.950000        71295        20.00
     129.727     0.956250        71762        22.86
     138.495     0.962500        72232        26.67
     147.839     0.968750        72705        32.00
     152.447     0.971875        72936        35.56
     157.567     0.975000        73168        40.00
     163.583     0.978125        73402        45.71
     171.775     0.981250        73636        53.33
     181.887     0.984375        73873        64.00
     188.287     0.985938        73988        71.11
     194.687     0.987500        74106        80.00
     204.671     0.989062        74223        91.43
     217.599     0.990625        74340       106.67
     230.271     0.992188        74457       128.00
     237.311     0.992969        74516       142.22
     244.735     0.993750        74574       160.00
     251.391     0.994531        74633       182.86
     258.303     0.995313        74694       213.33
     264.959     0.996094        74751       256.00
     269.055     0.996484        74780       284.44
     274.687     0.996875        74809       320.00
     283.647     0.997266        74838       365.71
     292.863     0.997656        74869       426.67
     300.543     0.998047        74898       512.00
     307.455     0.998242        74912       568.89
     311.551     0.998437        74926       640.00
     314.879     0.998633        74941       731.43
     321.535     0.998828        74957       853.33
     330.751     0.999023        74970      1024.00
     333.823     0.999121        74978      1137.78
     336.895     0.999219        74986      1280.00
     342.271     0.999316        74992      1462.86
     346.111     0.999414        75000      1706.67
     348.671     0.999512        75008      2048.00
     349.951     0.999561        75011      2275.56
     353.279     0.999609        75014      2560.00
     355.071     0.999658        75018      2925.71
     362.751     0.999707        75022      3413.33
     365.823     0.999756        75025      4096.00
     368.639     0.999780        75027      4551.11
     372.223     0.999805        75029      5120.00
     380.671     0.999829        75031      5851.43
     388.095     0.999854        75033      6826.67
     388.607     0.999878        75034      8192.00
     389.887     0.999890        75035      9102.22
     392.959     0.999902        75036     10240.00
     394.239     0.999915        75037     11702.86
     394.495     0.999927        75038     13653.33
     396.031     0.999939        75039     16384.00
     396.031     0.999945        75039     18204.44
     399.615     0.999951        75041     20480.00
     399.615     0.999957        75041     23405.71
     399.615     0.999963        75041     27306.67
     399.615     0.999969        75041     32768.00
     399.615     0.999973        75041     36408.89
     404.479     0.999976        75042     40960.00
     404.479     0.999979        75042     46811.43
     404.479     0.999982        75042     54613.33
     404.479     0.999985        75042     65536.00
     404.479     0.999986        75042     72817.78
     410.623     0.999988        75043     81920.00
     410.623     1.000000        75043          inf
#[Mean    =       20.684, StdDeviation   =       42.643]
#[Max     =      410.368, Total count    =        75043]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  90030 requests in 1.00m, 18.46MB read
Requests/sec:   1500.48
Transfer/sec:    315.04KB